M-o-a-T/moat/moat/micro/_embed/boards/esp32/s3/mpconfigboard.h
#ifndef MICROPY_HW_BOARD_NAME
// Can be set by mpconfigboard.cmake.
#define MICROPY_HW_BOARD_NAME               "MoaT ESP32-S3"
#endif
#define MICROPY_HW_MCU_NAME                 "ESP32S3"

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1)

// these are for BaguetteS3
#define MICROPY_HW_I2C0_SCL                 (48)
#define MICROPY_HW_I2C0_SDA                 (47)
